Revit 2026 API
EnergyDataSettings.OutsideAirPerArea Property
 The rate of flow of outside air available per unit area.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public double OutsideAirPerArea { get; set; }
Public Property OutsideAirPerArea As Double
	Get
	Set
public:
property double OutsideAirPerArea {
	double get ();
	void set (double value);
}
member OutsideAirPerArea : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The outside airPerArea does not fall within an appropriate range.
Remarks
 Stored in cubic feet per hour per square foot.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace